app/controllers/keys_controller.rb

SELECT * FROM "keys" WHERE ("keys"."url" = '3dl@jvpl') LIMIT 1
---
  def show
    @key = Key.find_by_url(params[:key_url])

INSERT INTO "keys" ("license_key", "updated_at", "url", "created_at") VALUES(NULL, '2009-05-27 00:10:48', NULL, '2009-05-27 00:10:48')
---
  def create
    @key = Key.new(:license_key => params[:license_key])

    respond_to do |format|
      if @key.save